;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v6.4.6 *
;* Date/Time created: Thu Feb 11 10:11:22 2016                 *
;***************************************************************
	.compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --quiet --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=3 
FP	.set	XAR2

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/fastRTS_sample.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.6 Copyright (c) 1996-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\ricieri.ohashi\Desktop\FAC_Imas\C28_new\FPUfastRTS\V100\examples_ccsv4\2833x_fastRTS\Debug")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("cos")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("_cos")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$17)
	.dwendtag $C$DW$1


$C$DW$3	.dwtag  DW_TAG_subprogram, DW_AT_name("atan")
	.dwattr $C$DW$3, DW_AT_TI_symbol_name("_atan")
	.dwattr $C$DW$3, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$3, DW_AT_declaration
	.dwattr $C$DW$3, DW_AT_external

	.dwpsn	file "C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/fastRTS_sample.c",line 138,column 13,is_stmt,isa 0
        MOV       AL,*-SP[3]            ; [CPU_] |138| 
        CMPB      AL,#64                ; [CPU_] |138| 
        BF        $C$L8,HIS             ; [CPU_] |138| 
        ; branchcc occurs ; [] |138| 
$C$L7:    
	.dwpsn	file "C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/fastRTS_sample.c",line 140,column 9,is_stmt,isa 0
$C$DW$23	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$23, DW_AT_low_pc(0x00)
	.dwattr $C$DW$23, DW_AT_name("_atan")
	.dwattr $C$DW$23, DW_AT_TI_call
        LCR       #_atan                ; [CPU_] |140| 
        ; call occurs [#_atan] ; [] |140| 
        CLRC      SXM                   ; [CPU_] 
        MOVL      XAR4,#_Dlog+256       ; [CPU_U] |140| 
        MOV       ACC,*-SP[3] << 1      ; [CPU_] |140| 
        ADDL      XAR4,ACC              ; [CPU_] |140| 
        MOV32     *+XAR4[0],R0H         ; [CPU_] |140| 
	.dwpsn	file "C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/fastRTS_sample.c",line 141,column 9,is_stmt,isa 0
        MOVW      DP,#_Step+10          ; [CPU_U] 
        MOV32     R0H,@_Step+10         ; [CPU_] |141| 
        ADDF32    R0H,R0H,#16032        ; [CPU_] |141| 
        NOP       ; [CPU_] 
        MOV32     @_Step+10,R0H         ; [CPU_] |141| 
	.dwpsn	file "C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/fastRTS_sample.c",line 138,column 32,is_stmt,isa 0
        INC       *-SP[3]               ; [CPU_] |138| 
	.dwpsn	file "C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/fastRTS_sample.c",line 138,column 13,is_stmt,isa 0
        MOV       AL,*-SP[3]            ; [CPU_] |138| 
        CMPB      AL,#64                ; [CPU_] |138| 
        BF        $C$L7,LO              ; [CPU_] |138| 
        ; branchcc occurs ; [] |138| 
$C$L8:    
	.dwpsn	file "C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/fastRTS_sample.c",line 145,column 5,is_stmt,isa 0
$C$DW$24	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$24, DW_AT_low_pc(0x00)
	.dwattr $C$DW$24, DW_AT_name("_done")
	.dwattr $C$DW$24, DW_AT_TI_call
        LCR       #_done                ; [CPU_] |145| 
        ; call occurs [#_done] ; [] |145| 
	.dwpsn	file "C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/fastRTS_sample.c",line 146,column 1,is_stmt,isa 0
        MOVB      AL,#0                 ; [CPU_] |146| 
        SUBB      SP,#14                ; [CPU_U] 
	.dwcfi	cfa_offset, -2
$C$DW$25	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$25, DW_AT_low_pc(0x00)
	.dwattr $C$DW$25, DW_AT_TI_return
        LRETR     ; [CPU_] 
        ; return occurs ; [] 
	.dwattr $C$DW$11, DW_AT_TI_end_file("C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/fastRTS_sample.c")
	.dwattr $C$DW$11, DW_AT_TI_end_line(0x92)
	.dwattr $C$DW$11, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$11

	.sect	".text"
	.clink
	.global	_done

$C$DW$26	.dwtag  DW_TAG_subprogram, DW_AT_name("done")
	.dwattr $C$DW$26, DW_AT_low_pc(_done)
	.dwattr $C$DW$26, DW_AT_high_pc(0x00)
	.dwattr $C$DW$26, DW_AT_TI_symbol_name("_done")
	.dwattr $C$DW$26, DW_AT_external
	.dwattr $C$DW$26, DW_AT_TI_begin_file("C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/fastRTS_sample.c")
	.dwattr $C$DW$26, DW_AT_TI_begin_line(0x94)
	.dwattr $C$DW$26, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$26, DW_AT_TI_max_frame_size(-2)
	.dwpsn	file "C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/fastRTS_sample.c",line 149,column 1,is_stmt,address _done,isa 0

	.dwfde $C$DW$CIE, _done

;***************************************************************
;* FNAME: _done                         FR SIZE:   0           *
;*                                                             *
;* FUNCTION ENVIRONMENT                                        *
;*                                                             *
;* FUNCTION PROPERTIES                                         *
;*                            0 Parameter,  0 Auto,  0 SOE     *
;***************************************************************

_done:
	.dwcfi	cfa_offset, -2
	.dwcfi	save_reg_to_mem, 26, 0
	.dwpsn	file "C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/fastRTS_sample.c",line 150,column 4,is_stmt,isa 0
   ESTOP0
	.dwpsn	file "C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/fastRTS_sample.c",line 151,column 1,is_stmt,isa 0
        SPM       #0                    ; [CPU_] 
$C$DW$27	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$27, DW_AT_low_pc(0x00)
	.dwattr $C$DW$27, DW_AT_TI_return
        LRETR     ; [CPU_] 
        ; return occurs ; [] 
	.dwattr $C$DW$26, DW_AT_TI_end_file("C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/fastRTS_sample.c")
	.dwattr $C$DW$26, DW_AT_TI_end_line(0x97)
	.dwattr $C$DW$26, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$26

;**************************************************************
;* UNDEFINED EXTERNAL REFERENCES                              *
;**************************************************************
	.global	_cos
	.global	_atan
	.global	_sin
	.global	_sqrt
	.global	FS$$DIV

;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_name("DATA_LOG_C")
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x280)
$C$DW$28	.dwtag  DW_TAG_member
	.dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$28, DW_AT_name("SINwaveform")
	.dwattr $C$DW$28, DW_AT_TI_symbol_name("_SINwaveform")
	.dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$29	.dwtag  DW_TAG_member
	.dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$29, DW_AT_name("COSwaveform")
	.dwattr $C$DW$29, DW_AT_TI_symbol_name("_COSwaveform")
	.dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$30	.dwtag  DW_TAG_member
	.dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$30, DW_AT_name("ATANwaveform")
	.dwattr $C$DW$30, DW_AT_TI_symbol_name("_ATANwaveform")
	.dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
	.dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$31	.dwtag  DW_TAG_member
	.dwattr $C$DW$31, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$31, DW_AT_name("Phase")
	.dwattr $C$DW$31, DW_AT_TI_symbol_name("_Phase")
	.dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
	.dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$32	.dwtag  DW_TAG_member
	.dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$32, DW_AT_name("Mag")
	.dwattr $C$DW$32, DW_AT_TI_symbol_name("_Mag")
	.dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$21


$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_name("STEP")
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x14)
$C$DW$33	.dwtag  DW_TAG_member
	.dwattr $C$DW$33, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$33, DW_AT_name("Xsize")
	.dwattr $C$DW$33, DW_AT_TI_symbol_name("_Xsize")
	.dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$34	.dwtag  DW_TAG_member
	.dwattr $C$DW$34, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$34, DW_AT_name("Ysize")
	.dwattr $C$DW$34, DW_AT_TI_symbol_name("_Ysize")
	.dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$35	.dwtag  DW_TAG_member
	.dwattr $C$DW$35, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$35, DW_AT_name("Yoffset")
	.dwattr $C$DW$35, DW_AT_TI_symbol_name("_Yoffset")
	.dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$36	.dwtag  DW_TAG_member
	.dwattr $C$DW$36, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$36, DW_AT_name("X")
	.dwattr $C$DW$36, DW_AT_TI_symbol_name("_X")
	.dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$37	.dwtag  DW_TAG_member
	.dwattr $C$DW$37, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$37, DW_AT_name("Y")
	.dwattr $C$DW$37, DW_AT_TI_symbol_name("_Y")
	.dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$38	.dwtag  DW_TAG_member
	.dwattr $C$DW$38, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$38, DW_AT_name("Z")
	.dwattr $C$DW$38, DW_AT_TI_symbol_name("_Z")
	.dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$39	.dwtag  DW_TAG_member
	.dwattr $C$DW$39, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$39, DW_AT_name("GainX")
	.dwattr $C$DW$39, DW_AT_TI_symbol_name("_GainX")
	.dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$40	.dwtag  DW_TAG_member
	.dwattr $C$DW$40, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$40, DW_AT_name("GainY")
	.dwattr $C$DW$40, DW_AT_TI_symbol_name("_GainY")
	.dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$41	.dwtag  DW_TAG_member
	.dwattr $C$DW$41, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$41, DW_AT_name("FreqX")
	.dwattr $C$DW$41, DW_AT_TI_symbol_name("_FreqX")
	.dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$42	.dwtag  DW_TAG_member
	.dwattr $C$DW$42, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$42, DW_AT_name("FreqY")
	.dwattr $C$DW$42, DW_AT_TI_symbol_name("_FreqY")
	.dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$22

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
$C$DW$T$26	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$26, DW_AT_address_class(0x20)
$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x02)

$C$DW$T$20	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x80)
$C$DW$43	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$43, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$20

$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x02)

$C$DW$T$19	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$19, DW_AT_byte_size(0x80)
$C$DW$44	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$44, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$19

$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
	.dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

$C$DW$CIE	.dwcie 26
	.dwcfi	cfa_register, 20
	.dwcfi	cfa_offset, 0
	.dwcfi	undefined, 0
	.dwcfi	undefined, 1
	.dwcfi	undefined, 2
	.dwcfi	undefined, 3
	.dwcfi	undefined, 20
	.dwcfi	undefined, 21
	.dwcfi	undefined, 22
