TMS320C2000 Assembler PC v6.4.6 Thu Feb 11 10:11:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fastRTS_sample.asm                                                   PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.6 *
       3              ;* Date/Time created: Thu Feb 11 10:11:22 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/exampl
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.6 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\ricieri.ohashi\Desktop\FAC_Imas\C28_new\FPUfastRTS\V100\ex
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("cos")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_cos")

     393                      .dwattr $C$DW$24, DW_AT_TI_call
     394 00000132 7640'         LCR       #_done                ; [CPU_] |145| 
         00000133 0137 
     395                      ; call occurs [#_done] ; [] |145| 
     396                      .dwpsn  file "C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/
     397 00000134 9A00          MOVB      AL,#0                 ; [CPU_] |146| 
     398 00000135 FE8E          SUBB      SP,#14                ; [CPU_U] 
     399                      .dwcfi  cfa_offset, -2
     400              $C$DW$25        .dwtag  DW_TAG_TI_branch
     401                      .dwattr $C$DW$25, DW_AT_low_pc(0x00)
     402                      .dwattr $C$DW$25, DW_AT_TI_return
     403 00000136 0006          LRETR     ; [CPU_] 
     404                      ; return occurs ; [] 
     405                      .dwattr $C$DW$11, DW_AT_TI_end_file("C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100
     406                      .dwattr $C$DW$11, DW_AT_TI_end_line(0x92)
     407                      .dwattr $C$DW$11, DW_AT_TI_end_column(0x01)
     408                      .dwendentry
     409                      .dwendtag $C$DW$11
     410              
     411 00000137               .sect   ".text"
     412                      .clink
     413                      .global _done
     414              
     415              $C$DW$26        .dwtag  DW_TAG_subprogram, DW_AT_name("done")
     416                      .dwattr $C$DW$26, DW_AT_low_pc(_done)
TMS320C2000 Assembler PC v6.4.6 Thu Feb 11 10:11:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fastRTS_sample.asm                                                   PAGE   11

     417                      .dwattr $C$DW$26, DW_AT_high_pc(0x00)
     418                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_done")
     419                      .dwattr $C$DW$26, DW_AT_external
     420                      .dwattr $C$DW$26, DW_AT_TI_begin_file("C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V1
     421                      .dwattr $C$DW$26, DW_AT_TI_begin_line(0x94)
     422                      .dwattr $C$DW$26, DW_AT_TI_begin_column(0x06)
     423                      .dwattr $C$DW$26, DW_AT_TI_max_frame_size(-2)
     424                      .dwpsn  file "C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/
     425              
     426                      .dwfde $C$DW$CIE, _done
     427              
     428              ;***************************************************************
     429              ;* FNAME: _done                         FR SIZE:   0           *
     430              ;*                                                             *
     431              ;* FUNCTION ENVIRONMENT                                        *
     432              ;*                                                             *
     433              ;* FUNCTION PROPERTIES                                         *
     434              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     435              ;***************************************************************
     436              
     437 00000137       _done:
     438                      .dwcfi  cfa_offset, -2
     439                      .dwcfi  save_reg_to_mem, 26, 0
     440                      .dwpsn  file "C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/
     441 00000137 7625     ESTOP0
     442                      .dwpsn  file "C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100/examples_ccsv4/source/
     443 00000138 FF69          SPM       #0                    ; [CPU_] 
     444              $C$DW$27        .dwtag  DW_TAG_TI_branch
     445                      .dwattr $C$DW$27, DW_AT_low_pc(0x00)
     446                      .dwattr $C$DW$27, DW_AT_TI_return
     447 00000139 0006          LRETR     ; [CPU_] 
     448                      ; return occurs ; [] 
     449                      .dwattr $C$DW$26, DW_AT_TI_end_file("C:/Users/ricieri.ohashi/Desktop/FAC_Imas/C28_new/FPUfastRTS/V100
     450                      .dwattr $C$DW$26, DW_AT_TI_end_line(0x97)
     451                      .dwattr $C$DW$26, DW_AT_TI_end_column(0x01)
     452                      .dwendentry
     453                      .dwendtag $C$DW$26
     454              
     455              ;**************************************************************
     456              ;* UNDEFINED EXTERNAL REFERENCES                              *
     457              ;**************************************************************
     458                      .global _cos
     459                      .global _atan
     460                      .global _sin
     461                      .global _sqrt
     462                      .global FS$$DIV
     463              
     464              ;***************************************************************
     465              ;* TYPE INFORMATION                                            *
     466              ;***************************************************************
     467              
     468              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     469                      .dwattr $C$DW$T$21, DW_AT_name("DATA_LOG_C")
     470                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x280)
     471              $C$DW$28        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Feb 11 10:11:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fastRTS_sample.asm                                                   PAGE   12

     472                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     473                      .dwattr $C$DW$28, DW_AT_name("SINwaveform")
     474                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_SINwaveform")
     475                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     476                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     477              $C$DW$29        .dwtag  DW_TAG_member
     478                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     479                      .dwattr $C$DW$29, DW_AT_name("COSwaveform")
     480                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_COSwaveform")
     481                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
     482                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     483              $C$DW$30        .dwtag  DW_TAG_member
     484                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     485                      .dwattr $C$DW$30, DW_AT_name("ATANwaveform")
     486                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_ATANwaveform")
     487                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
     488                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     489              $C$DW$31        .dwtag  DW_TAG_member
     490                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$20)
     491                      .dwattr $C$DW$31, DW_AT_name("Phase")
     492                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_Phase")
     493                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
     494                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     495              $C$DW$32        .dwtag  DW_TAG_member
     496                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     497                      .dwattr $C$DW$32, DW_AT_name("Mag")
     498                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_Mag")
     499                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
     500                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     501                      .dwendtag $C$DW$T$21
     502              
     503              
     504              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     505                      .dwattr $C$DW$T$22, DW_AT_name("STEP")
     506                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x14)
     507              $C$DW$33        .dwtag  DW_TAG_member
     508                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$16)
     509                      .dwattr $C$DW$33, DW_AT_name("Xsize")
     510                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_Xsize")
     511                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     512                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     513              $C$DW$34        .dwtag  DW_TAG_member
     514                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$16)
     515                      .dwattr $C$DW$34, DW_AT_name("Ysize")
     516                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_Ysize")
     517                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     518                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     519              $C$DW$35        .dwtag  DW_TAG_member
     520                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$16)
     521                      .dwattr $C$DW$35, DW_AT_name("Yoffset")
     522                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_Yoffset")
     523                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     524                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     525              $C$DW$36        .dwtag  DW_TAG_member
     526                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$16)
TMS320C2000 Assembler PC v6.4.6 Thu Feb 11 10:11:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fastRTS_sample.asm                                                   PAGE   13

     527                      .dwattr $C$DW$36, DW_AT_name("X")
     528                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_X")
     529                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     530                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     531              $C$DW$37        .dwtag  DW_TAG_member
     532                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$16)
     533                      .dwattr $C$DW$37, DW_AT_name("Y")
     534                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_Y")
     535                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     536                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     537              $C$DW$38        .dwtag  DW_TAG_member
     538                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$16)
     539                      .dwattr $C$DW$38, DW_AT_name("Z")
     540                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_Z")
     541                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     542                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     543              $C$DW$39        .dwtag  DW_TAG_member
     544                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$16)
     545                      .dwattr $C$DW$39, DW_AT_name("GainX")
     546                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_GainX")
     547                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     548                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     549              $C$DW$40        .dwtag  DW_TAG_member
     550                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$16)
     551                      .dwattr $C$DW$40, DW_AT_name("GainY")
     552                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_GainY")
     553                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     554                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     555              $C$DW$41        .dwtag  DW_TAG_member
     556                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$16)
     557                      .dwattr $C$DW$41, DW_AT_name("FreqX")
     558                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_FreqX")
     559                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     560                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     561              $C$DW$42        .dwtag  DW_TAG_member
     562                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$16)
     563                      .dwattr $C$DW$42, DW_AT_name("FreqY")
     564                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_FreqY")
     565                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     566                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     567                      .dwendtag $C$DW$T$22
     568              
     569              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     570                      .dwattr $C$DW$T$2, DW_AT_name("void")
     571              $C$DW$T$4       .dwtag  DW_TAG_base_type
     572                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     573                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     574                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     575              $C$DW$T$5       .dwtag  DW_TAG_base_type
     576                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     577                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     578                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     579              $C$DW$T$6       .dwtag  DW_TAG_base_type
     580                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     581                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
TMS320C2000 Assembler PC v6.4.6 Thu Feb 11 10:11:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fastRTS_sample.asm                                                   PAGE   14

     582                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     583              $C$DW$T$7       .dwtag  DW_TAG_base_type
     584                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     585                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     586                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     587              $C$DW$T$8       .dwtag  DW_TAG_base_type
     588                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     589                      .dwattr $C$DW$T$8, DW_AT_name("short")
     590                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     591              $C$DW$T$9       .dwtag  DW_TAG_base_type
     592                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     593                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     594                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     595              $C$DW$T$10      .dwtag  DW_TAG_base_type
     596                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     597                      .dwattr $C$DW$T$10, DW_AT_name("int")
     598                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     599              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
     600                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$10)
     601                      .dwattr $C$DW$T$26, DW_AT_address_class(0x20)
     602              $C$DW$T$11      .dwtag  DW_TAG_base_type
     603                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     604                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     605                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     606              $C$DW$T$12      .dwtag  DW_TAG_base_type
     607                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     608                      .dwattr $C$DW$T$12, DW_AT_name("long")
     609                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     610              
     611              $C$DW$T$20      .dwtag  DW_TAG_array_type
     612                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$12)
     613                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     614                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x80)
     615              $C$DW$43        .dwtag  DW_TAG_subrange_type
     616                      .dwattr $C$DW$43, DW_AT_upper_bound(0x3f)
     617                      .dwendtag $C$DW$T$20
     618              
     619              $C$DW$T$13      .dwtag  DW_TAG_base_type
